package ru.cj264.geekbrains.java_core_for_android.hw8;

public class Main {
    public static void main(String[] args) {
        // 1. Создать 2 текстовых файла, примерно по 50-100 символов в каждом(особого значения не имеет);
        // 2. Написать метод, «склеивающий» эти файлы, то есть вначале идет текст из первого файла,
        //    потом текст из второго.
        // 3. * Написать метод, который проверяет присутствует ли указанное пользователем слово в файле
        //    (работаем только с латиницей).
        // 4. ** Написать метод, проверяющий, есть ли указанное слово в папке
    }
}
